package com.example.kakyunglee.smokingproject.activity.activity;

import android.content.Intent;
import android.os.Bundle;
import android.support.v7.app.ActionBar;
import android.support.v7.app.AppCompatActivity;
import android.widget.TextView;

import com.example.kakyunglee.smokingproject.R;

/**
 * Created by KakyungLee on 2017-10-23.
 */

public class LawDetailActivity extends AppCompatActivity {

    String content;
    String title;
    int position;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.law_detail);
        Intent intent = getIntent();
        int where = intent.getExtras().getInt("where");
        position = intent.getExtras().getInt("position");
        title = intent.getExtras().getString("title");

        getSupportActionBar().setDisplayOptions(ActionBar.DISPLAY_SHOW_CUSTOM);
        getSupportActionBar().setCustomView(R.layout.custom_bar);
        TextView barTitle = (TextView)findViewById(R.id.title_bar);
        barTitle.setText(title);

        if(where == 0){
            setHistoryFine();
        }
        else{
            setNoneSmokingArea(position);
        }

        TextView textView = (TextView)findViewById(R.id.contents);
        textView.setText(content);
    }

    private void setHistoryFine(){

        content = "[연혁]\n" +
                "\n" +
                "1995년 국민건강증진법의 제정으로 대형건물, 공연장, 학원, 대규모 점포, 관광숙박업소, 혼인예식장, 실내체육관, 의료기관, 사회복지시설, 교통시설관련 등 일부 시설에 금연구역 설치\n" +
                "\n" +
                "1999년에는 가정의례에 관한 법률에 의한 혼인예식장이 초/중등교육법 및 고등교육법에 의한 학교의 교사( 校舍 )로 개정\n" +
                "\n" +
                "2003년에는 청소년게임 제공업소, 인터넷컴퓨터게임시설 제공업소 및 복합유통게임 제공업소, 대형음식점, 만화방, 정부청사, 보육시설이 추가\n" +
                "\n" +
                "2006년에는 공장, 지방자치단체 청사, 실내작업장까지 금연구역 확대\n" +
                "\n" +
                "2008년에는 위의 시설에 설치된 승강기의 내부, 복도, 화장실 등 다수인이 이용하는 구역 및 공중위생관리법에 의한 목욕장이 추가\n" +
                "\n" +
                "2010년 지방자치단체 조례로 필요한 경우 실외 금연구역 지정(국민건강증진법 제 9조 6항 <신설 2010.5.27.>)\n" +
                "\n" +
                "2012년 12월, 공중이용시설 절대금연구역이 해당시설 전체로 확대, 휴게음식점, 일반음식점 및 제과점(술집, 나이트클럽 등은 제외)\n" +
                "\n" +
                "2013년 12월 31일까지: 150제곱미터 이상 영업소\n" +
                "\n" +
                "2014년 1월 1일부터 2014년 12월 31일까지: 100제곱미터 이상 영업소\n" +
                "\n" +
                "2015년 1월 1일부터: 모든 영업소\n" +
                "\n" +
                "2016년 9월, 공동주택 금연구역 지정 신청제 실시 (거주 세대의 중 2분의 1 이상이 그 공동주택의 복도, 계단, 엘리베이터 및 지하주차장의 전부 또는 일부)\n" +
                "\n" +
                "[과태료]\n" +
                "금연구역 지정 위반 : 500만원 이하 과태료\n" +
                "\n" +
                "금연구역 내 흡연 : 10만원 이하 과태료\n" +
                "\n" +
                "담배꽁초 쓰레기 투기 등 : 범칙금 3만원\n\n\n";
    }

    private void setNoneSmokingArea(int position){
        switch (position) {
            case 0:
                content ="\n"+
                        "국회의 청사\n\n" +
                        "정부 및 지방자치단체의 청사\n\n" +
                        "[법원조직법]에 따른 법원과 그 소속 기관 청사\n\n" +
                        "[공공기관의 운영에 관한 법률]에 따른 \n\n" +
                        "공공기관의 청사\n\n" +
                        "[지방공기업법]에 따른 지방공기업의 청사\n\n";
                break;
            case 1:
                content ="\n" +
                        "[유아교육법], [초중등교육법] 에 따른 학교\n\n" +
                        "[시설 전체 절대 금연 구역]\n"+
                        "교사 ( 校舍 )와 운동장 등 \n" +
                        "모든구역 포함\n" +
                        "\n\n" +
                        "[고등교육법]에 따른 학교\n\n" +
                        "[금연 구역 지정]\n" +
                        "학교의 교사( 校舍 )\n\n"+
                        "간접흡연 피해를 예방하기 위해 실외에 흡연실을 설치해야하며, 옥상이나 각 시설의 출입구로부터 10미터 이상의 거리에 설치하여야 함";
                break;
            case 2:
                content ="\n" +
                        "[의료법] 및 [지역보건법]에 해당하는 의료기관\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "의료기관, 보건소, 보건의료원, 보건지소\n"+
                        "간접흡연 피해를 예방하기 위해 실외에 흡연실을 설치해야하며, 옥상이나 각 시설의 출입구로부터 10미터 이상의 거리에 설치하여야 함";
                break;
            case 3:
                content ="\n" +
                        "[영유아보호법]에 따른 어린이집 *\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "어린이집\n" +
                        "\n\n" +
                        "[어린이놀이시설 안전관리법]에 따른 어린이 놀이시설 \n\n" +
                        "[금연 구역 지정]\n" +
                        "어린이 놀이기구가 설치된 \n" +
                        "시설 (놀이터)\n"+
                        "간접흡연 피해를 예방하기 위해 실외에 흡연실을 설치해야하며, 옥상이나 각 시설의 출입구로부터 10미터 이상의 거리에 설치하여야 함";
                break;
            case 4:
                content ="\n" +
                        "[청소년활동진흥법]에 따른 청소년 수련원, 수련관, 유스호스텔, 야영장, 청소년 이용시설 등의 청소년 활동시설\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "청소년수련원, 수련관, \n" +
                        "유스호스텔, \n" +
                        "청소년특화시설, \n" +
                        "청소년야영장, 유스호스텔, 청소년 이용시설 등\n"+
                        "간접흡연 피해를 예방하기 위해 실외에 흡연실을 설치해야하며, 옥상이나 각 시설의 출입구로부터 10미터 이상의 거리에 설치하여야 함";
                break;
            case 5:
                content ="\n" +
                        "[도서관법]에 따른 도서관\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "도서관\n"+
                        "간접흡연 피해를 예방하기 위해 실외에 흡연실을 설치해야하며, 옥상이나 각 시설의 출입구로부터 10미터 이상의 거리에 설치하여야 함";
                break;
            case 6:
                content ="\n" +
                        "[학원의 설립·운영 및 과외교습에 관한 법률]에 따른 학원\n\n" +
                        "[금연 구역 지정]\n" +
                        "1천㎡ 이상 학원\n";
                break;
            case 7:
                content ="\n" +
                        "공항·여객부두·철도역·여객자동차 터미널 등 교통 관련 시설\n\n" +
                        "[금연 구역 지정]\n" +
                        "대합실·승강장, 지하보도 및 16인승 이상의 교통수단으로서 여객 또는 화물을 유상으로 운송하는 것\n" +
                        "\n\n"+
                        "[자동차관리법]에 따른 어린이 운송용 승합자동차\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "어린이운송용 승합자동차\n" +
                        "간접흡연 피해를 예방하기 위해 실외에 흡연실을 설치해야하며, 옥상이나 각 시설의 출입구로부터 10미터 이상의 거리에 설치하여야 함";
                break;
            case 8:
                content ="\n" +
                        "연면적 1천㎡ 이상의 사무용 건축물, 공장 및 복합용도의 건축물\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "연면적 1천㎡ 이상의 사무용 건축물, 공장 및 복합용도의 건축물\n";
                break;
            case 9:
                content ="\n" +
                        "[공연법]에 따른 공연장으로서 객석수 300석 이상의 공연장\n\n" +
                        "[금연 구역 지정]\n" +
                        "객석 300석 이상의 공연장\n";
                break;
            case 10:
                content ="\n" +
                        "[유통산업발전법]에 따라 개설등록된 대규모점포와 " +
                        "상점가 중 지하도에 있는 상점가\n\n" +
                        "[금연 구역 지정]\n" +
                        "지하상가 중 상품이 판매되고 있는 매장 및 통로\n";
                break;
            case 11:
                content ="\n" +
                        "[관광진흥법]에 따른 관광숙박업소\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "관광숙박업소\n";
                break;
            case 12:
                content ="\n" +
                        "[체육시설의 설치·이용에 관한 법률]에 따른 체육시설로서 1천명이상의 관객을 수용할 수 있는 체육시설\n\n";
                break;
            case 13:
                content ="\n" +
                        "[사회복지사업법]에 따른 사회복지시설\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "사회복지시설\n";
                break;
            case 14:
                content ="\n" +
                        "[공중위생관리법]에 따른 목욕장\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "목욕장\n";
                break;
            case 15:
                content ="\n" +
                        "[게임산업진흥에 관한 법률]에 다른 청소년게임제공업소, 일반게임제공업소,인터넷컴퓨터게임시설제공업소 및 복합유통게임제공업소\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "청소년게임제공업소, \n" +
                        "일반게임제공업소,\n" +
                        "인터넷컴퓨터게임시설제공업소 및 복합유통게임제공업소\n";
                break;
            case 16:
                content ="\n" +
                        "[청소년보호법]에 따른 만화대여업소\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "만화방\n";
                break;
            case 17:
                content ="\n" +
                        "[식품위생법]에 따른 식품접객업 중 영업장의 넓이가 다음에 해당하는 휴게음식점영업소, 일반음식점 및 제과점영업소\n\n" +
                        "[시설전체 절대 금연 구역]\n"+
                        "모든영업소\t\n";
                break;
            case 18:
                content ="\n" +
                        "[도로법 시행령] 제2조제5호에 따른 휴게시설 중 고속국도에 설치한 휴게시설 및 그 부속시설\n\n" +
                        "[금연 구역 지정]\n" +
                        "고속도로휴게시설(주유소, 충전소 및 교통.관광안내소 포함), 부속시설 (지붕없는 건물 복도나 통로, 계단을 포함)\n" +
                        "\n";
                break;
            case 19:
                content ="\n" +
                        "[주택법] 제2조제3호에 따른 공동주택\n\n" +
                        "[시설전체 절대 금연 구역/금연 구역 지정]\n"+
                        "거주 세대 중 2분의 1 이상이 공동 주택의 복도, 계단, 엘리베이터 및 지하주차장의 전부 또는 일부를 금연구역으로 신청\n";
                break;
            case 20:
                content ="\n" +
                        "[산림보호법] 제34조제1항제2호 및 [산림보호법시행규칙] 제28조1항누구든지 산림 또는 산림으로부터 100m이내 위치한 토지(건물의 부속 토지는 제외)에서 흡연 및 담배꽁초 투기 금지\n\n" +
                        "[위반 관련 규정정]\n"+
                        "[산림보호법] 제57조4항제1호30만원 이하 과태료\n";
                break;
            case 21:
                content ="\n" +
                        "[자연공원법 시행령] 제26조자연공원관리청이 정하는 지역에서의 흡연 제한 및 금지\n" +
                        "\n" +
                        "[위반 관련 규정정]\n"+
                        "[자연공원법] 제86조제1항제5호200만원 이하의 과태료\n";
                break;
            case 22:
                content ="\n" +
                        "[서울 숭례문 관람 등에 관한 규정] 제5조제3항서울 숭례문의 경계 울타리 내 전지역\n" +
                        "\n" +
                        "[위반 관련 규정정]\n"+
                        "관람중지, 퇴장 등 조치\n";
                break;
            case 23:
                content ="\n" +
                        "[여객자동차 운수사업법] 제26조제1항제7호의2 및 제27조의2제2항운수종사자 및 여객은 여객자동차운송사업용 자동차 안에서 흡연 행위 금지\n" +
                        "\n" +
                        "[위반 관련 규정정]\n"+
                        "[여객자동차 운수사업법] 제94조제3항제4호50만원 이하의 과태료\n";
                break;
            case 24:
                content ="\n" +
                        "[철도안전법] 제47조제4호여객은 여객열차에서 흡연 행위 금지\n" +
                        "\n" +
                        "[위반 관련 규정정]\n"+
                        "[철도안전법] 제81조제1항제11호1천만원이하 과태료\n";
                break;
            case 25:
                content ="\n" +
                        "[공항시설관리규칙] 제19조제7호공항의 흡연이 금지된 장소에서 흡연 금지\n" +
                        "\n";
                break;
            case 26:
                content ="\n" +
                        "[항공보안법] 제23조제1항제2호항공기 내 흡연행위 금지\n" +
                        "\n" +
                        "[위반 관련 규정정]\n"+
                        "[항공보안법] 제50조제3항 및 제2항제3호\n" +
                        "• 계류 중인 항공기 내에서 흡연, 200만원 이하 벌금(흡연구역에서의 흡연 제외)\n" +
                        "• 운항 운중 항공기 내에서 흡연, 500만원 이하 벌금\n";
                break;
            case 27:
                content ="\n" +
                        "[문화재보호법 제14조제5항] 다음 해당하는 시설 또는 지역의 소유자, 관리자 및 관리단체는 해당 시설 또는 지역 전체를 금연구역으로 지정하거나 금연구역과 흡연구역으로 구분하여 지정\n" +
                        "• 지정문화재 및 보호구역 중 목조건축물(주거용 건축물 제외)\n" +
                        "• 그 밖에 지정문화재 중 문화체육관광부령 또는 시‧도 조례로 정하는 시설 또는 지역\n" +
                        "\n" +
                        "[위반 관련 규정정]\n"+
                        "[문화재보호법] 제103조제1항제1호500만원 이하 과태료\n";
                break;
            case 28:
                content ="\n" +
                        "• 지방자치단체는 흡연으로 인한 피해 방지와 주민의 건강 증진을 위하여 필요하다고 인정하는 경우 조례로 다수인이 모이거나 오고가는 관할 구역 안의 일정한 장소를 금연구역으로 지정(국민건강증진법 제9조제6항)\n\n" +
                        "• 지방자치단체별 간접흡연 피해방지 조례는 국가법령정보센터 사이트에서 확인 가능 (자치법규 검색)";
                break;
        }

    }


}
